Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
mples: Refreshing state... [id=cm0ykk]
module.sbeacon.module.python_modules_layer.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/8ec362cbcfc12f0b1b16838b7653221f08c7da03e4e64e0434b07cc3700aed80.zip]
module.svep[0].data.archive_file.binaries_layer: Read complete after 9s [id=27eb763efa285cb07fbe005eb64336f0665499c7]
module.svep[0].aws_api_gateway_integration_response.vcfstats-options: Refreshing state... [id=agir-fr0h77aedl-hxdr94-OPTIONS-200]
module.sbeacon.module.cors-datasets-id.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-7dagqd-OPTIONS]
module.svep[0].aws_api_gateway_integration_response.results-options: Refreshing state... [id=agir-fr0h77aedl-fyto2l-OPTIONS-200]
module.sbeacon.module.cors-admin-proxy.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-v6g40p-OPTIONS]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-0kjrew-OPTIONS]
module.svep[0].aws_api_gateway_integration_response.submit-options: Refreshing state... [id=agir-fr0h77aedl-w7xtcw-OPTIONS-200]
module.sbeacon.module.cors-datasets.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-y3hb5m-OPTIONS]
module.sbeacon.module.cors-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-uds2w5-OPTIONS]
module.sbeacon.module.cors-datasets.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-y3hb5m-OPTIONS-200]
module.sbeacon.module.cors-runs.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-zj9kwx-OPTIONS-200]
module.sbeacon.data.archive_file.binaries_layer: Still reading... [10s elapsed]
module.sbeacon.data.archive_file.binaries_layer: Read complete after 11s [id=436635fc4d6bebf859f1672560f18a8764458999]
module.sbeacon.module.cors-runs.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-zj9kwx-OPTIONS]
module.sbeacon.module.cors-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-uds2w5-OPTIONS-200]
module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-ocbafw-OPTIONS]
module.sbeacon.module.cors-runs-id.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-3a0k7f-OPTIONS]
module.sbeacon.module.cors-analyses.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-zbiv26-OPTIONS]
module.sbeacon.module.python_libraries_layer.data.external.archive_prepare[0]: Read complete after 4s [id=-]
module.sbeacon.module.cors-analyses.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-zbiv26-OPTIONS-200]
module.sbeacon.module.cors-analyses-id.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-r6g9en-OPTIONS]
module.sbeacon.module.cors-analyses-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-3p0rl2-OPTIONS]
module.sbeacon.module.cors-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-zfefrf-OPTIONS]
module.sbeacon.module.cors-entry_types.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-a88e4r-OPTIONS]
module.sbeacon.module.cors-g_variants-id.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-jhbvft-OPTIONS]
module.sbeacon.module.cors-configuration.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-kx113a-OPTIONS]
module.sbeacon.module.cors-map.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-oio1wd-OPTIONS-200]
module.sbeacon.module.cors-map.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-oio1wd-OPTIONS]
module.sbeacon.module.cors-projects.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-nvu8df-OPTIONS]
module.sbeacon.module.cors-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-zfefrf-OPTIONS-200]
module.sbeacon.module.cors-entry_types.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-a88e4r-OPTIONS-200]
module.sbeacon.module.cors-configuration.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-kx113a-OPTIONS-200]
module.sbeacon.module.cors-projects.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-nvu8df-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-srad5w-OPTIONS]
module.sbeacon.module.cors-biosamples.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-1zoxya-OPTIONS]
module.sbeacon.module.cors-biosamples.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-1zoxya-OPTIONS-200]
module.sbeacon.module.cors-info.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-7p4ge2-OPTIONS]
module.sbeacon.module.cors-dportal-proxy.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-nam5qf-OPTIONS]
module.sbeacon.module.cors-individuals.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-w6hskl-OPTIONS]
module.sbeacon.module.cors-info.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-7p4ge2-OPTIONS-200]
module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-e1fux0-OPTIONS]
module.sbeacon.module.cors-individuals.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-w6hskl-OPTIONS-200]
module.sbeacon.module.cors-biosamples-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-cxcmgq-OPTIONS]
module.sbeacon.module.cors-individuals-id.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-j0lt7b-OPTIONS]
module.svep[0].aws_lambda_layer_version.binaries_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-3:438465168484:layer:svep_backend_binaries_layer:7]
module.sbeacon.module.cors-datasets-id-biosamples.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-6eexan-OPTIONS]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-0kjrew-OPTIONS-200]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-0kjrew-OPTIONS]
module.sbeacon.aws_lambda_layer_version.binaries_layer: Refreshing state... [id=arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_binaries_layer:8]
module.sbeacon.module.cors-datasets-id-g_variants.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-otus0z-OPTIONS]
module.sbeacon.module.cors-admin-proxy.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-v6g40p-OPTIONS]
module.sbeacon.module.cors-admin-proxy.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-v6g40p-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-4tfmup-OPTIONS]
module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-ocbafw-OPTIONS]
module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-ocbafw-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-individuals.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-8i72qo-OPTIONS]
module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-h7z0fn-OPTIONS]
module.sbeacon.module.python_libraries_layer.local_file.archive_plan[0]: Refreshing state... [id=466e332c9b82a64191f42a68482e460665f2d195]
module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-d6x3d0-OPTIONS]
module.sbeacon.module.cors-analyses-id.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-r6g9en-OPTIONS]
module.sbeacon.module.cors-analyses-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-r6g9en-OPTIONS-200]
module.sbeacon.module.cors-analyses-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-3p0rl2-OPTIONS-200]
module.sbeacon.module.cors-analyses-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-3p0rl2-OPTIONS]
module.sbeacon.module.cors-runs-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-3a0k7f-OPTIONS-200]
module.sbeacon.module.cors-runs-id.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-3a0k7f-OPTIONS]
module.sbeacon.module.cors-g_variants-id.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-jhbvft-OPTIONS]
module.sbeacon.module.cors-g_variants-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-jhbvft-OPTIONS-200]
module.sbeacon.module.cors-map.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-oio1wd-OPTIONS-200]
module.sbeacon.module.cors-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-zfefrf-OPTIONS-200]
module.sbeacon.module.cors-configuration.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-kx113a-OPTIONS-200]
module.sbeacon.module.cors-analyses-id-g_variants.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-x0yxrr-OPTIONS]
module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-egwaf8-OPTIONS]
module.sbeacon.module.cors-analyses.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-zbiv26-OPTIONS-200]
module.sbeacon.module.cors-runs.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-zj9kwx-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-mvrw3g-OPTIONS]
module.sbeacon.module.cors-dportal-proxy.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-nam5qf-OPTIONS-200]
module.sbeacon.module.cors-dportal-proxy.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-nam5qf-OPTIONS]
module.sbeacon.module.cors-datasets-id.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-7dagqd-OPTIONS]
module.sbeacon.module.cors-datasets-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-7dagqd-OPTIONS-200]
module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-e1fux0-OPTIONS-200]
module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-e1fux0-OPTIONS]
module.sbeacon.module.cors-biosamples-id.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-srad5w-OPTIONS]
module.sbeacon.module.cors-biosamples-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-srad5w-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-analyses.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-ux4wkm-OPTIONS]
module.sbeacon.module.cors-biosamples-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-cxcmgq-OPTIONS-200]
module.sbeacon.module.cors-biosamples-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-cxcmgq-OPTIONS]
module.sbeacon.module.cors-individuals-id.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-j0lt7b-OPTIONS-200]
module.sbeacon.module.cors-individuals-id.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-j0lt7b-OPTIONS]
module.sbeacon.module.cors-biosamples-id-g_variants.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-re455d-OPTIONS]
module.sbeacon.module.cors-biosamples-id-runs.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-yjzd6q-OPTIONS]
module.svep[0].module.python_modules_layer.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:ap-southeast-3:438465168484:layer:svep_backend_python_modules_layer:5]
module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-rtt1l7-OPTIONS]
module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_method._: Refreshing state... [id=agm-wfavief721-cm0ykk-OPTIONS]
module.sbeacon.module.python_modules_layer.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_modules_layer:4]
module.sbeacon.module.cors-individuals.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-w6hskl-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-otus0z-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-otus0z-OPTIONS]
module.sbeacon.module.cors-info.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-7p4ge2-OPTIONS-200]
module.sbeacon.module.cors-datasets-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-0kjrew-OPTIONS-200]
module.sbeacon.module.cors-entry_types.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-a88e4r-OPTIONS-200]
module.sbeacon.module.cors-admin-proxy.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-v6g40p-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-biosamples.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-6eexan-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-biosamples.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-6eexan-OPTIONS]
module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-h7z0fn-OPTIONS]
module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-h7z0fn-OPTIONS-200]
module.sbeacon.module.python_libraries_layer.null_resource.archive[0]: Refreshing state... [id=2720509165556192396]
module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-d6x3d0-OPTIONS-200]
module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-d6x3d0-OPTIONS]
module.sbeacon.module.cors-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-1zoxya-OPTIONS-200]
module.sbeacon.module.cors-analyses-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-3p0rl2-OPTIONS-200]
module.sbeacon.module.cors-runs-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-3a0k7f-OPTIONS-200]
module.sbeacon.module.cors-projects.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-nvu8df-OPTIONS-200]
module.sbeacon.module.cors-runs-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-ocbafw-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-4tfmup-OPTIONS]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-4tfmup-OPTIONS-200]
module.sbeacon.module.cors-analyses-id-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-x0yxrr-OPTIONS]
module.sbeacon.module.cors-analyses-id-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-x0yxrr-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-egwaf8-OPTIONS]
module.sbeacon.module.cors-analyses-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-r6g9en-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-egwaf8-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-mvrw3g-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-mvrw3g-OPTIONS]
module.sbeacon.module.cors-datasets-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-7dagqd-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-jhbvft-OPTIONS-200]
module.sbeacon.module.cors-datasets.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-y3hb5m-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-srad5w-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-analyses.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-ux4wkm-OPTIONS]
module.sbeacon.module.cors-biosamples-id-analyses.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-ux4wkm-OPTIONS-200]
module.sbeacon.module.cors-dportal-proxy.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-nam5qf-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-re455d-OPTIONS]
module.sbeacon.module.cors-biosamples-id-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-re455d-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-runs.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-yjzd6q-OPTIONS]
module.sbeacon.module.cors-biosamples-id-runs.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-yjzd6q-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-individuals.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-8i72qo-OPTIONS]
module.sbeacon.module.cors-datasets-id-individuals.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-8i72qo-OPTIONS-200]
module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-cm0ykk-OPTIONS]
module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-cm0ykk-OPTIONS-200]
module.sbeacon.module.cors-biosamples-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-cxcmgq-OPTIONS-200]
module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_integration._: Refreshing state... [id=agi-wfavief721-rtt1l7-OPTIONS]
module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_method_response._: Refreshing state... [id=agmr-wfavief721-rtt1l7-OPTIONS-200]
module.sbeacon.module.cors-individuals-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-e1fux0-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-6eexan-OPTIONS-200]
module.sbeacon.module.cors-runs-id-analyses.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-d6x3d0-OPTIONS-200]
module.sbeacon.module.cors-individuals-id.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-j0lt7b-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-mvrw3g-OPTIONS-200]
module.sbeacon.module.cors-runs-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-h7z0fn-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-analyses.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-ux4wkm-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-re455d-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-4tfmup-OPTIONS-200]
module.sbeacon.module.cors-biosamples-id-runs.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-yjzd6q-OPTIONS-200]
module.sbeacon.module.cors-g_variants-id-individuals.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-egwaf8-OPTIONS-200]
module.sbeacon.module.cors-analyses-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-x0yxrr-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-otus0z-OPTIONS-200]
module.sbeacon.module.cors-datasets-id-individuals.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-8i72qo-OPTIONS-200]
module.sbeacon.module.python_libraries_layer.aws_s3_object.lambda_package[0]: Refreshing state... [id=builds/69a5a2ebf6fca419a014a55936057be21805e0ca462f74974197adb8897d7451.zip]
module.sbeacon.module.cors-individuals-id-g_variants.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-rtt1l7-OPTIONS-200]
module.sbeacon.module.python_libraries_layer.aws_lambda_layer_version.this[0]: Refreshing state... [id=arn:aws:lambda:ap-southeast-3:438465168484:layer:sbeacon_backend_python_libraries_layer:6]
module.sbeacon.module.cors-individuals-id-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-cm0ykk-OPTIONS-200]
module.sbeacon.module.cors-filtering_terms.aws_api_gateway_integration_response._: Refreshing state... [id=agir-wfavief721-uds2w5-OPTIONS-200]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.cognito.data.aws_iam_policy_document.admin_group_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_authenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_authenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.gaspi_unauthenticated will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "gaspi_unauthenticated" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "unauthenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendRegistrationEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendRegistrationEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:438465168484:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:438465168484:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.lambda-sendSvepJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendSvepJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "ses:SendEmail",
            ]
          + resources = [
              + "arn:aws:ses:ap-southeast-3:438465168484:identity/*",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "ssm:GetParameter",
            ]
          + resources = [
              + "arn:aws:ssm:ap-southeast-3:438465168484:parameter/bui-ssm-beacon-ui-url",
            ]
        }
    }

  # module.cognito.data.aws_iam_policy_document.manager_group_assume_role_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "manager_group_assume_role_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]

          + condition {
              + test     = "ForAnyValue:StringLike"
              + values   = [
                  + "authenticated",
                ]
              + variable = "cognito-identity.amazonaws.com:amr"
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + (known after apply),
                ]
              + variable = "cognito-identity.amazonaws.com:aud"
            }

          + principals {
              + identifiers = [
                  + "cognito-identity.amazonaws.com",
                ]
              + type        = "Federated"
            }
        }
    }

  # module.cognito.data.aws_iam_policy_document.ses-sns-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ses-sns-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "sns:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AllowSESToPublishToSNS"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "438465168484",
                ]
              + variable = "aws:SourceAccount"
            }

          + principals {
              + identifiers = [
                  + "ses.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.cognito.aws_cognito_identity_pool.gaspi_identity_pool will be created
  + resource "aws_cognito_identity_pool" "gaspi_identity_pool" {
      + allow_classic_flow               = false
      + allow_unauthenticated_identities = false
      + arn                              = (known after apply)
      + id                               = (known after apply)
      + identity_pool_name               = "gaspi-users"
      + tags                             = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                         = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }

      + cognito_identity_providers {
          + client_id               = (known after apply)
          + provider_name           = (known after apply)
          + server_side_token_check = false
        }
    }

  # module.cognito.aws_cognito_identity_pool_roles_attachment.gaspi_cognito_roles will be created
  + resource "aws_cognito_identity_pool_roles_attachment" "gaspi_cognito_roles" {
      + id               = (known after apply)
      + identity_pool_id = (known after apply)
      + roles            = (known after apply)

      + role_mapping {
          + ambiguous_role_resolution = "AuthenticatedRole"
          + identity_provider         = (known after apply)
          + type                      = "Token"
        }
    }

  # module.cognito.aws_cognito_user.admin will be created
  + resource "aws_cognito_user" "admin" {
      + attributes            = {
          + "email"          = "admin@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Admin"
          + "given_name"     = "Admin"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "admin@example.com"
    }

  # module.cognito.aws_cognito_user.guest will be created
  + resource "aws_cognito_user" "guest" {
      + attributes            = {
          + "email"          = "guest@example.com"
          + "email_verified" = "true"
          + "family_name"    = "Guest"
          + "given_name"     = "Guest"
          + "terraform"      = "true"
        }
      + creation_date         = (known after apply)
      + enabled               = true
      + id                    = (known after apply)
      + last_modified_date    = (known after apply)
      + mfa_setting_list      = (known after apply)
      + password              = (sensitive value)
      + preferred_mfa_setting = (known after apply)
      + status                = (known after apply)
      + sub                   = (known after apply)
      + user_pool_id          = (known after apply)
      + username              = "guest@example.com"
    }

  # module.cognito.aws_cognito_user_group.admin_group will be created
  + resource "aws_cognito_user_group" "admin_group" {
      + description  = "Group of users who can has admin privileges"
      + id           = (known after apply)
      + name         = "administrators"
      + precedence   = 1
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_group.manager_group will be created
  + resource "aws_cognito_user_group" "manager_group" {
      + description  = "Group of users who can has management privileges"
      + id           = (known after apply)
      + name         = "managers"
      + precedence   = 2
      + role_arn     = (known after apply)
      + user_pool_id = (known after apply)
    }

  # module.cognito.aws_cognito_user_in_group.admin_in_admin_group will be created
  + resource "aws_cognito_user_in_group" "admin_in_admin_group" {
      + group_name   = "administrators"
      + id           = (known after apply)
      + user_pool_id = (known after apply)
      + username     = "admin@example.com"
    }

  # module.cognito.aws_cognito_user_pool.gaspi_user_pool will be created
  + resource "aws_cognito_user_pool" "gaspi_user_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + deletion_protection        = "INACTIVE"
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OPTIONAL"
      + name                       = "gaspi-users"
      + sms_verification_message   = (known after apply)
      + tags                       = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all                   = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + user_pool_tier             = (known after apply)

      + account_recovery_setting {
          + recovery_mechanism {
              + name     = "verified_email"
              + priority = 1
            }
        }

      + admin_create_user_config {
          + allow_admin_create_user_only = true
        }

      + email_configuration {
          + configuration_set     = "ses-feedback-config"
          + email_sending_account = "DEVELOPER"
          + from_email_address    = "dian.larasaty@xapiens.id"
          + source_arn            = "arn:aws:ses:ap-southeast-3:438465168484:identity/dian.larasaty@xapiens.id"
        }

      + lambda_config {
          + custom_message       = (known after apply)
          + pre_token_generation = (known after apply)

          + pre_token_generation_config (known after apply)
        }

      + password_policy {
          + minimum_length                   = 8
          + require_lowercase                = true
          + require_numbers                  = true
          + require_symbols                  = true
          + require_uppercase                = true
          + temporary_password_validity_days = 7
        }

      + schema {
          + attribute_data_type      = "Boolean"
          + developer_only_attribute = false
          + mutable                  = false
          + name                     = "terraform"
          + required                 = false
        }
      + schema {
          + attribute_data_type      = "String"
          + developer_only_attribute = false
          + mutable                  = true
          + name                     = "identity_id"
          + required                 = false

          + string_attribute_constraints {
                # (2 unchanged attributes hidden)
            }
        }

      + sign_in_policy (known after apply)

      + sms_configuration (known after apply)

      + software_token_mfa_configuration {
          + enabled = true
        }

      + username_configuration (known after apply)

      + verification_message_template (known after apply)
    }

  # module.cognito.aws_cognito_user_pool_client.gaspi_user_pool_client will be created
  + resource "aws_cognito_user_pool_client" "gaspi_user_pool_client" {
      + access_token_validity                         = 5
      + allowed_oauth_flows                           = (known after apply)
      + allowed_oauth_flows_user_pool_client          = (known after apply)
      + allowed_oauth_scopes                          = (known after apply)
      + auth_session_validity                         = 3
      + callback_urls                                 = (known after apply)
      + client_secret                                 = (sensitive value)
      + default_redirect_uri                          = (known after apply)
      + enable_propagate_additional_user_context_data = (known after apply)
      + enable_token_revocation                       = (known after apply)
      + explicit_auth_flows                           = [
          + "ALLOW_ADMIN_USER_PASSWORD_AUTH",
          + "ALLOW_REFRESH_TOKEN_AUTH",
          + "ALLOW_USER_PASSWORD_AUTH",
        ]
      + id                                            = (known after apply)
      + id_token_validity                             = 5
      + logout_urls                                   = (known after apply)
      + name                                          = "gaspi-users-client"
      + prevent_user_existence_errors                 = (known after apply)
      + read_attributes                               = (known after apply)
      + refresh_token_validity                        = 2
      + supported_identity_providers                  = (known after apply)
      + user_pool_id                                  = (known after apply)
      + write_attributes                              = (known after apply)

      + token_validity_units {
          + access_token  = "minutes"
          + id_token      = "minutes"
          + refresh_token = "hours"
        }
    }

  # module.cognito.aws_iam_policy.admin_group_role_policy will be created
  + resource "aws_iam_policy" "admin_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "admin group permissions"
      + id               = (known after apply)
      + name             = "gaspi-admin-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gasi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.aws_iam_policy.manager_group_role_policy will be created
  + resource "aws_iam_policy" "manager_group_role_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "manager group permissions"
      + id               = (known after apply)
      + name             = "gaspi-manager-group-role-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/projects/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gasi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                  + {
                      + Action   = "pricing:*"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.aws_iam_role.admin_group_role will be created
  + resource "aws_iam_role" "admin_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi-admin-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.gaspi_authenticated will be created
  + resource "aws_iam_role" "gaspi_authenticated" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_authenticated"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.gaspi_unauthenticated will be created
  + resource "aws_iam_role" "gaspi_unauthenticated" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi_unauthenticated"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role.manager_group_role will be created
  + resource "aws_iam_role" "manager_group_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "gaspi-manager-group-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.aws_iam_role_policy.gaspi_authenticated will be created
  + resource "aws_iam_role_policy" "gaspi_authenticated" {
      + id          = (known after apply)
      + name        = "authenticated_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "private/${cognito-identity.amazonaws.com:sub}/",
                                  + "private/${cognito-identity.amazonaws.com:sub}/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::gasi-dataportal-*"
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-*/private/${cognito-identity.amazonaws.com:sub}/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.cognito.aws_iam_role_policy.gaspi_unauthenticated will be created
  + resource "aws_iam_role_policy" "gaspi_unauthenticated" {
      + id          = (known after apply)
      + name        = "unauthenticated_policy"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "*"
                      + Effect   = "Deny"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.cognito.aws_iam_role_policy_attachment.admin_group_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "admin_group_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "gaspi-admin-group-role"
    }

  # module.cognito.aws_iam_role_policy_attachment.manager_group_role_policy_attachment will be created
  + resource "aws_iam_role_policy_attachment" "manager_group_role_policy_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "gaspi-manager-group-role"
    }

  # module.cognito.aws_lambda_permission.SNSemailNotification will be created
  + resource "aws_lambda_permission" "SNSemailNotification" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "CognitoBackendAllowSNSemailNotificationInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.cognito.aws_lambda_permission.customMessageLambdaTrigger will be created
  + resource "aws_lambda_permission" "customMessageLambdaTrigger" {
      + action              = "lambda:InvokeFunction"
      + function_name       = (known after apply)
      + id                  = (known after apply)
      + principal           = "cognito-idp.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SBeaconBackendAllowCustomMessageLambdaTriggerInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.cognito.aws_ses_configuration_set.ses_feedback_config will be created
  + resource "aws_ses_configuration_set" "ses_feedback_config" {
      + arn                        = (known after apply)
      + id                         = (known after apply)
      + last_fresh_start           = (known after apply)
      + name                       = "ses-feedback-config"
      + reputation_metrics_enabled = false
      + sending_enabled            = true
    }

  # module.cognito.aws_ses_event_destination.ses_feedback_event_destination will be created
  + resource "aws_ses_event_destination" "ses_feedback_event_destination" {
      + arn                    = (known after apply)
      + configuration_set_name = "ses-feedback-config"
      + enabled                = true
      + id                     = (known after apply)
      + matching_types         = [
          + "bounce",
          + "complaint",
          + "delivery",
        ]
      + name                   = "ses-feedback-event-destination"

      + sns_destination {
          + topic_arn = (known after apply)
        }
    }

  # module.cognito.aws_ses_identity_notification_topic.bounce will be created
  + resource "aws_ses_identity_notification_topic" "bounce" {
      + id                       = (known after apply)
      + identity                 = "dian.larasaty@xapiens.id"
      + include_original_headers = true
      + notification_type        = "Bounce"
      + topic_arn                = (known after apply)
    }

  # module.cognito.aws_ses_identity_notification_topic.complaint will be created
  + resource "aws_ses_identity_notification_topic" "complaint" {
      + id                       = (known after apply)
      + identity                 = "dian.larasaty@xapiens.id"
      + include_original_headers = true
      + notification_type        = "Complaint"
      + topic_arn                = (known after apply)
    }

  # module.cognito.aws_ses_identity_notification_topic.delivery will be created
  + resource "aws_ses_identity_notification_topic" "delivery" {
      + id                       = (known after apply)
      + identity                 = "dian.larasaty@xapiens.id"
      + include_original_headers = true
      + notification_type        = "Delivery"
      + topic_arn                = (known after apply)
    }

  # module.cognito.aws_sns_topic.sesDeliveryLogger will be created
  + resource "aws_sns_topic" "sesDeliveryLogger" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "sesDeliveryLogger"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tracing_config              = (known after apply)
    }

  # module.cognito.aws_sns_topic_policy.sesDeliveryLogger will be created
  + resource "aws_sns_topic_policy" "sesDeliveryLogger" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

  # module.cognito.aws_sns_topic_subscription.sesDeliveryLogger will be created
  + resource "aws_sns_topic_subscription" "sesDeliveryLogger" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.sbeacon.data.aws_iam_policy_document.admin-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "admin-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "cognito-idp:*",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-full-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-full-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.athena-readonly-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "athena-readonly-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "athena:GetQueryExecution",
              + "athena:GetQueryResults",
              + "athena:StartQueryExecution",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "glue:*",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:438465168484:table/sbeacon-dataportal-pricing-cache",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "pricing:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:AddTags",
              + "sagemaker:CreateNotebookInstance",
              + "sagemaker:CreatePresignedNotebookInstanceUrl",
              + "sagemaker:DeleteNotebookInstance",
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:ListNotebookInstances",
              + "sagemaker:StartNotebookInstance",
              + "sagemaker:StopNotebookInstance",
              + "sagemaker:UpdateNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:438465168484:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:ListNotebookInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*",
                  + "private/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250523065507414800000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-onto-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Scan",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-onto-write-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-onto-write-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.dynamodb-quota-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "dynamodb-quota-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + (known after apply),
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.ec2_deidentification_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ec2_deidentification_policy" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
     
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.